import type { RouteInfo } from "@/components/layout/header/type";


export const routeInfos: Record<string, RouteInfo> = {
  '/': {
    title: 'داشبورد',
    description:
      'در این قسمت، می‌توانید یک دید کلی در مورد عملکرد خود و سایر کارشناسان مشاهده و مدیریت کنید.',
  },
  '/dashboard': {
    title: 'داشبورد',
    description:
      'در این قسمت، می‌توانید یک دید کلی در مورد عملکرد خود و سایر کارشناسان مشاهده و مدیریت کنید.',
  },
  '/definition': {
    title: 'تعاریف',
    description:
      'در این قسمت، می‌توانید یک دید کلی در مورد عملکرد خود و سایر کارشناسان مشاهده و مدیریت کنید.',
  },
  '/orders': {
    title: 'سفارش‌ها',
    description: 'در این قسمت، می‌توانید سفارش‌ها را مشاهده و مدیریت کنید.',
  },
  '/orders/:slug': {
    title: 'سفارش‌ها',
    description: 'در این قسمت، می‌توانید سفارش‌ها را مشاهده و مدیریت کنید.',
  },

  '/reports': {
    title: 'گزارش‌ها',
    description: 'در این قسمت، می‌توانید گزارش‌های عملکرد را مشاهده کنید.',
  },
  '/foods': {
    title: 'غذاها',
    description: 'در این قسمت، می‌توانید غذاهای ثبت شده را مدیریت کنید.',
  },
  '/contracts': {
    title: 'قراردادها',
    description:
      'در این قسمت، می‌توانید لیست مشتریان را مشاهده و وعده‌های غذایی آنها را مدیریت کنید.',
  },
  '/drivers': {
    title: 'رانندگان',
    description:
      'در این قسمت، می‌توانید لیست رانندگان را مشاهده و مدیریت کنید.',
  },
  '/drivers/:id': {
    title: '',
    description: '',
  },
};